{
  "arthur_lewyin":{
    "appearence": "As King Grey, Arthur had pale, short blonde hair. He had a large build from extensive training and was seen wearing a pale, yellow robe or tunic with long white pants that end just before his calves, which were paired with brown sandals. During times of war, Grey is seen in a full-body armor suit. Born as Arthur Leywin, Arthur had short auburn brown hair and large bright azure eyes. He had a small round face and was generally dressed in solid-colored fabrics by his mother. As he grew older, his hair started to grow longer, with short bangs sweeping across his forehead. At the age of eight, Arthur had grown taller and his hair had grown significantly, extending just past his ears, above his neck. Once he had returned from Elenoir to Xyrus City in Sapin, Arthur had a haircut, which left him with short hair with long bangs that swept across his forehead. He often wore solid-colored shorts that are matched with a button-up shirt. His shoes were typically brown and he opted to wear long socks, although this is only on the cover of the Tapas and kakaopage comics. In the comics themselves, he would often wear a white button-up shirt with a string necktie and grey shorts with brown suspenders. As for footwear, he would wear black dress shoes likely without socks. As an adventurer, Arthur wears a black turtleneck long sleeve, which are paired with black pants and boots. He wears a loose, pale, argyle shirt beneath a hooded, navy blue jacket with grey markings across the sleeves. His face is covered with a white, full-face mask with a blue half note printed alongside his left eye hole. Arthur wears black, spiked aurochs skinned, fingerless gloves with three green, single-use healing spell gems embedded on the knuckles. Along with his gloves, he also wears a silver ring on his ring finger, which matches with his mother's red jeweled ring. He also carries a dark olive hiker's backpack, with a green sleeping bag rolled up beneath it and his two swords strapped on both sides of his waist. Arthur Leywin, as a teenager, was of above-average height, taller than many of the adults around him, with auburn hair and azure eyes. He has a well-built body due to his continuous training. Using Realmheart, his eyes turn from their normal azure color to a lavender color, his hair, which turns from auburn to white, has orange tips and grows beyond his neck. Golden runes are also seen to spread throughout his whole body. After several battles against various enemies, his body was covered in scars; but the ones on his neck and left hand stood most prominently, which came from his fight against Jagrette. At the start of Volume 8, however, Arthur has changed physically. He now looks to be in his early 20s and described his traces as sharper, while his skin is now a cream-white tone with no scars and calluses at all and his once auburn hair is wheat-colored. His eyes are now golden tinged with some blue, and although his body is still toned(as if it had been drawn on), he is a bit thinner now. According to Kathyln Glayder, he can also be considered more handsome than before. He has runes running down his spinal back that roughly describe his aetheric spells as a rare subtype of pure mana and a black rune running down the inside of his right forearm, which is his Extra-Dimensional Storage Rune. His Godrunes are camouflaged among those pseudo runes, which become only visible when Arthur imbues Aether into them.",
    "personality": "King Grey's reincarnation into the new world as Arthur allowed his personality and memories to be carried over, influencing how his new personality developed. This led to him having an astoundingly mature personality all throughout his early life and adolescence, often thinking of the big picture and accurately understanding the events and the impact of such events that are occurring around him. Although his logical maturity was very high due to him having lived more than 35 years already, because of how he lived his previous life with an emotional ‘shell’ around his mind, which prevented him from connecting to anyone closely, his emotional maturity does leave a lot to be desired, as he is seen to struggle constantly when dealing with the emotions his newfound loved ones give him. This can lead to him sometimes reacting excessively and explosively when they are threatened or at risk. After the war was lost and Sylvie sacrificed her physical body to save him from dying because of his overuse of the third phase of his beast will, he became cold and detached again, just like in his past life, almost losing his sanity and empathy in the process. Moreover, his hatred for the Alacryans increased tremendously after Sylvie’s ‘death’ but was smothered by Regis, who prevented him from falling into despair and insanity. Caera was another reason that helped him to retain his empathy, as his encounter with her, an Alacryan noble who took pity on him when he was at his weakest, had a big impact on him. Moreover, as she later also befriended him and spent a year together with him in Alacrya, his hatred towards the Alacryans slowly faded. In fact, he let go of his hatred toward the Alacryans and instead pinned the blame for everything that happened on Agrona Vritra and Kezess Indrath because of the atrocities both parties committed. After returning to Dicathen, he returns to his normal self, and the armor of coldness and detachment in his Grey persona crumbles. Thanks to Sylvie's sacrifice, he ultimately becomes more clear-headed so that he does not lose anyone he loves anymore, and after spending a year in Alacrya, his goal shifts from protecting only his friends and loved ones to protecting and saving the world so that no one will suffer from the Asura-Vritra conflict anymore. When Arthur activates his King's Gambit godrune, he becomes coldly logical, removing all of the emotions that makes his thoughts and solutions ineffective. After Arthur exits the 4th Keystone, he is much more emotionally mature and is more open about his feelings towards his loved ones namely Tessia. He is less prone to making rash judgements and is more strategic. Unfortunately, he starts to become more addicted to using King's Gambit and relies on it's abilities too often. Fortunately, with help from Regis and Sylvie, he is becoming less addicted to it and more reliant on his own decisions over the ones provided by King's Gambit.",
    "background": "In his previous life, Arthur lived by the name Grey. He lived on a dystopian, futuristic Earth, born as an orphan in Etharia. He lived in an orphanage alongside his childhood friends Nico Sever and Cecilia. Due to the somewhat impoverished nature of the orphanage he lived in, Grey and Nico resorted to criminal activities (predominantly burglary of the rich) to assist their orphanage. He lived like this until the day he met a young Cecilia who had an attack and her ki got out of control; Grey saved her and from that day a friendship began between Nico, Grey, and Cecilia. Everything was at peace until one day when Cecilia was almost kidnapped by a man who referred to her as the ‘Legacy’. She was rescued by Grey and Nico, however upon their return to the orphanage they found it to be engulfed in flames, killing the headmaster. Following the death of his motherly figure, who was Headmaster Wilbeck of the orphanage, Grey's mind was consumed by revenge and in a bid to gain more power, he enrolled in cadet school, despite its risks, to become strong enough to take revenge. His friends Nico and Cecilia followed him even though he tried to stop them. The group's relationship started well in the academy setting but increasingly became more strained since Grey no longer met with them as much (he also gave up his personal feelings for Cecilia for the benefit of his friend Nico, who had the same feelings) because of the training; there he met a woman named Vera who became his teacher and a second mother figure for him. Increasingly more distant with Cecilia and Nico, Grey continued with his training to become king. The climax came when Cecilla was kidnapped by the organization that was looking for the Legacy. Nico and Grey went out to look for her. Although Nico wanted to continue searching, Grey considered that if it was really the government that kidnapped her, there was nothing that could be done, which caused a big fight between them and their friendship never healed. Months passed and a contest began to elect the new king. Although Grey continued trying to contact Nico and make peace again, this could not be achieved. At the contest, Grey saw Cecilia and, relieved. As the competition progresses, Cecilia and Grey advance and reach the final. Before the final, Nico escapes and explains where he was during the months he was missing. He explains that he was held captive and that they were using Cecilia. He also explains that Vera belongs to that organization and what their objective was. In addition, he explained that Vera alone chose Grey only because he was a naive orphan and that he was only used for their schemes. Added to that, he explains that he has a plan to rescue Cecilia. A dismayed Grey cannot believe any of this, believing that Nico is rambling and that his evidence was not very convincing before heading to the combat stadium for his final fight against Cecilia. Unfortunately for Grey, it turned out that everything Nico said was true and as a consequence, everything ended in the death of Cecilia, who, seeking freedom and not being treated as a weapon, let Grey's sword kill her. All of this caused his friendship with Nico to break for good and caused an existential void within him. After that, he started a war in Trayden as revenge for Vera's actions, destroying that entire country (although it is not known what role Grey played in this). Throughout his later life as King Grey, he eschewed any and all long-term attachments, seeing them as weaknesses that others could exploit and in doing so hardened his heart and closed off his emotions. He lived like this until the moment of his death, and when he thought everything was over, he had been reincarnated as Arthur Leywin, at which point he decided to live a completely different life than the one he had lived in his previous life.",
    "trivia" : ["Arthur's name was chosen after his great-grandfather, from the days when the Leywin house was far more powerful.",
                "Arthur is ranked 2nd in the comic's character popularity poll, receiving over 3500 votes.",
                "Arthur does not have a sweet tooth but he has a soft spot for cute things.",
                "Arthurs lifespan is much longer than a humans.",
                "Sylvie doesn't give Arthur her body; she gives up her body so that his can be rebuilt. Because her body contains so much more mana than his, the rebuilt body ends up being more powerful asuran-hybrid body.",
                "Arthur is a terrible cook who burns almost everything he cooks and mixes oil with water.",
                "Agrona has commented that he and Arthur think so much alike when Arthur was hiding for the fourth keystone.",
                "Arthur has been nicknamed 'princess' by Regis due to being mistaken as a woman when he first met Caera in the Relictombs.",
                "Ellie notes that Arthur makes a specific facial expression whenever he telepathically communicates with Sylvie or Regis.",
                "Arthur is the only person in existence to have an aether core.",
                "Arthur himself states that Agrona likely would've given up fighting to take Dicathen, but Arthur's aether core makes him a target that Agrona just can't pass up on.",
                "Arthur added a handguard to his aether sword design due to his hand getting cut from a sword maneuver by The Second Djinn Remnant, during their training on aether weapons.",
                "Arthur would later find Dawn's Ballad, shattered. He decides not to fix it with Aroa's Requiem since he doesn't need it anymore and doesn't want to look back to the past.",
                "Arthur has had a natural instinct for fighting, as shown by his first life as king Grey where he had reflexes that made him an outstanding opponent."],
    "relationship":{
      "alice_lewyin":"Having been birthed from her, Arthur obviously cares about his mother immensely and, despite memories of a previous life, truly feels she is his mother, particularly because he lacked parental love before. Arthur would do almost anything for his family, as shown when he willingly leapt from an extremely high cliff to protect his mother, nearly losing his life in the process; he survived and was later able to communicate with his parents through Rinia's help, prompting them both to weep, having believed him dead. Because Arthur often returns home bruised or injured, his mother constantly worries for him whenever he’s away. After learning about Arthur’s previous life and his subsequent departure to train, their relationship suffered, yet she continued trying to understand; though not fully reconciled even after his return years later, she gradually came to accept him. Following his father’s death, Arthur feared his mother and sister would blame him for failing to protect them and thus avoided them, but upon their reunion, his mother was overjoyed rather than resentful, and they reconciled at last. Nearly shattered by Arthur’s apparent death, she found the strength to move on for Ellie’s sake, and when Arthur later returned from Alacrya to save them from Taci, she was at first incredulous due to his changed appearance, but when he smiled like his father, she broke down in tears, overwhelmed with happiness; since then, their relationship has slowly been healing, gently returning to what it once was.",
      "reynolds_lewyin": "Arthur's relationship with his father was one of a normal father and son relationship. His father was incredibly proud of him, having birthed a prodigy in the family. Like Alice, Reynolds also cried after finally knowing that his son was safe. After being told about Arthur's previous life, Reynolds began to doubt whether or not Arthur was his son or a man who stole the life of his to-be-born son. However, after some thought, he began to accept it and was the one to help Alice come to terms with the news they had just received. After Arthur's return, he was embraced by Reynolds, who had already accepted Arthur's past life and Arthur as a son. After Arthur became a Lance, he and Reynolds conflicted frequently over their role in the war. Arthur wanted his parents to stay safe in the war, but Reynolds wanted to fight and serve Dicathen on the battlefield. Reynolds called Arthur a hypocrite, considering that Arthur has to fight in the war but won't let him and Alice fight. Arthur knows that he can't shackle his parents, but his selfishness for his loved ones stops him from admitting that. They met for the final time at The Wall, where Reynolds died to a mana beast. After the death of Reynolds, Arthur broke down, turning from a strong general to a mere boy who had just lost his father. Arthur regrets not having the chance to say goodbye to his father. Even after Reynolds passed away, Arthur always regarded him as the only person to ever love him as a father.",
      "eleanor_lewyin": "Eleanor Leywin is Arthur's younger sister. She is four years younger than him (except for a period of 3 months, where the age gap is shortened to 3 years). His sister's personality could be described as innocent as a little kid, shown by the fact that she repeated the curse her father, shouted after hearing about his son's progress despite not knowing what said curse meant or that it was bad to say. Eleanor essentially grew up without her brother since Arthur was always gone. Thus when he returned from training with the Asuras, Arthur was disheartened to see Eleanor had lost most of her innocence as a girl growing up in a war. Eleanor cherished whatever time she spent with Arthur since she knew it won't be long before he leaves again. After Arthur's apparent 'death', Eleanor matured significantly. She initially hated Tess as she held her responsible for Arthur and Sylvie's deaths. She misses her deceased father and brother, and vows to take care of her mother in their absence. It was revealed that Eleanor always knew of Arthur's reincarnation. She overheard her mother and her father arguing over Arthur and figured out her brother wasn't from her world. She still loved him regardless of his past and accepted him for who he was. After he returns from Alacrya to save them from Taci, she instantly recognized and embraced him in tears after he defeats Taci.",
      "jasmine_flamesworth": "Jasmine is an older sister and mentor figure for Arthur, and as they spent more time together, they also became close as comrade adventurers. She was one of his first students in his second life, since he taught most of the members of the Twin Horns after they saw his move during their journey to the city, although he doesn't consider them his students as they are his parent's friends and she also teaches him during his adventuring days since they were always together at that time. After Arthur argued with his parents, Jasmine came to comforted him. She is one of, if not the, Twin Horn member closest to Arthur. Arthur's apparent death during the war makes her nearly lose all hope, but he returns again to save them from Taci. She is very glad to have him back. Jasmine also acompanies Arthur to retake Xyrus City from Augustine Ramseyer."
    }
  }
}